# -*- coding: utf-8 -*-

# 所有业务名
service = ['普通护照签发、换发、补发及加注--首次申请护照',
           '普通护照签发、换发、补发及加注--护照加注',
           '普通护照签发、换发、补发及加注--护照补发',
           '普通护照签发、换发、补发及加注--换发护照',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '机动车登记与临时通行牌证核发--机动车登记',
           '客运出租汽车经营资格证件核发--客运出租汽车经营资格证核发',
           '客运出租汽车经营资格证件核发--网络预约出租汽车驾驶员证核发',
           '客运出租汽车经营资格证件核发--驾驶员客运资格证核发',
           '教师资格的认定', '养犬登记'
           ]

# 各业务的关键词的权重
requirement_weight = [
    {'首次申请护照': 100, '首次': 50, '签发': 50, '普通': 10, '护照': 50, '外国': 10, '定居': 10, '探亲': 10, '学习': 10, '就业': 10, '旅行': 10,
     '商务活动': 10, '非公务原因': 10, '出国': 10, '申请': 10, '办理': 10, '公民': 10},
    {'护照加注': 100, '曾用名': 33, '曾用名加注': 33, '繁体': 20, '汉字': 20, '英文': 25, '多音字': 25, '非标准': 16, '汉语': 16, '发音': 16,
     '姓名': 16, '姓名加注': 16, '曾持照': 25, '加注项': 25, '加注': 25, '曾持照加注': 25, '普通': 10, '护照': 50, '外国': 10, '定居': 10,
     '探亲': 10, '学习': 10, '就业': 10, '旅行': 10, '商务活动': 10, '非公务原因': 10, '出国': 10, '申请': 10, '办理': 10, '公民': 10},
    {'护照补发': 100, '损毁': 33, '不能使用': 33, '被盗': 33, '遗失': 33, '补发': 33, '普通': 10, '护照': 50, '外国': 10, '定居': 10, '探亲': 10,
     '学习': 10, '就业': 10, '旅行': 10, '商务活动': 10, '非公务原因': 10, '出国': 10, '申请': 10, '办理': 10, '公民': 10},
    {'换发护照': 100, '有效期': 33, '届满': 33, '签证页': 33, '使用': 33, '完毕': 33, '换发': 33, '普通': 10, '护照': 50, '外国': 10, '定居': 10,
     '探亲': 10, '学习': 10, '就业': 10, '旅行': 10, '商务活动': 10, '非公务原因': 10, '出国': 10, '申请': 10, '办理': 10, '公民': 10},
    {'初次申领机动车号牌和行驶证': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '所有人': 10, '申请': 10, '注册': 10,
     '初次': 50, '申领': 50, '号牌': 50, '行驶证': 50},
    {'改变车身颜色': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '变更': 10, '申请': 10, '注册': 10, '所有人': 10,
     '改变': 50, '车身': 50, '颜色': 50},
    {'更换发动机': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '变更': 10, '申请': 10, '注册': 10, '所有人': 10,
     '更换': 50, '发动机': 50},
    {'更换车身车架': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '变更': 10, '申请': 10, '注册': 10, '所有人': 10,
     '更换': 50, '车身': 50, '车架': 50},
    {'因质量问题更换整车': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '变更': 10, '申请': 10, '注册': 10,
     '所有人': 10, '更换': 50, '质量': 50, '问题': 50, '整车': 50},
    {'改变运营模式和使用性质': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '变更': 10, '申请': 10, '注册': 10,
     '所有人': 10, '改变': 50, '营运': 50, '非营运': 50, '模式': 50, '使用': 50, '性质': 50},
    {'车辆管理所管辖区域改变': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '变更': 10, '申请': 10, '注册': 10,
     '所有人': 10, '住所': 50, '迁入': 50, '迁出': 50, '管辖': 50, '区域': 50},
    {'已注册登记车辆所有权发生改变': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '注册': 10, '道路': 10, '交通': 10,
     '违法': 10, '行为': 10, '事故': 10, '所有权': 50, '转移': 50},
    {'机动车抵押': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '所有人': 10, '消灭': 10, '解除': 10, '抵押物': 50,
     '抵押': 50, '抵押权': 50},
    {'已达到国家强制报废标准': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '回收企业': 10, '交售': 10, '解体': 10,
     '回收证明': 10, '强制': 50, '报废': 50, '标准': 50},
    {'灭失': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '所有人': 10, '登记地': 10, '申请': 10, '注销': 10},
    {'因故不在我国境内使用': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '所有人': 10, '登记地': 10, '申请': 10,
     '注销': 10, '不在': 50, '境内': 50, '使用': 50},
    {'因质量问题退车': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '所有人': 10, '登记地': 10, '申请': 10,
     '注销': 10, '质量': 50, '问题': 50, '退车': 50},
    {'机动车登记被依法撤销': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '所有人': 10, '登记地': 10, '申请': 10,
     '注销': 10, '依法': 50, '撤销': 50},
    {'被依法收缴并强制报废的': 100, '机动车': 5, '登记': 5, '临时': 5, '通行牌证': 5, '签发': 5, '车辆管理所': 5, '所有人': 10, '登记地': 10, '申请': 10,
     '注销': 10, '达到': 10, '国家': 10, '强制': 10, '报废': 10, '标准': 10, '依法': 50, '收缴': 50},
    {'客运出租汽车经营资格证核发': 100, '核发': 20, '客运': 20, '出租': 20, '汽车': 20, '经营': 20, '资格': 20, '证件': 20, '资格证': 20},
    {'网络预约出租汽车驾驶员证核发': 100, '网络': 50, '预约': 50, '出租': 20, '汽车': 20, '驾驶员证': 20, '核发': 20, '准驾车型': 10, '机动车': 10,
     '驾驶证': 10, '3年以上': 10, '驾驶经历': 10, '连续3个记分周期': 10, '记满12分': 10, '5年内': 10, '吊销': 10},
    {'驾驶员客运资格证核发': 100, '客运': 50, '驾驶员': 20, '资格证': 20, '核发': 20, '三年以上': 10, '驾驶经历': 10, '机动车': 10, '驾驶证': 10,
     '职业': 10, '培训': 10, '考试': 10, '合格': 10, '申请日': 10, '五年内': 10, '吊销': 10, '连续3个记分周期': 10, '记满12分': 10},
    {'认定教师资格': 100, '认定': 50, '天津': 10, '户籍': 10, '签注期限内': 10, '居住证': 10, '就读': 10, '学校': 10, '教师': 50, '资格': 50,
     '考试': 50, '合格': 50},
    {'养犬登记': 100, '养犬': 50, '登记': 50, '本市': 10, '常住': 10, '户口': 10, '暂住': 10, '证件': 10, '合法': 10, '身份': 10, '证明': 10,
     '完全': 10, '民事': 10, '行为': 10, '能力': 10, '独户': 10, '居住': 10, '条件': 10}
]

# 各业务的权重值最大的关键词
slot_max_weight = {'首次申请护照': 100, '护照加注': 100, '护照补发': 100, '换发护照': 100, '初次申领机动车号牌和行驶证': 100, '改变车身颜色': 100,
                   '更换发动机': 100, '更换车身车架': 100, '因质量问题更换整车': 100, '改变运营模式和使用性质': 100, '车辆管理所管辖区域改变': 100,
                   '已注册登记车辆所有权发生改变': 100, '机动车抵押': 100, '已达到国家强制报废标准': 100, '灭失': 100, '因故不在我国境内使用': 100,
                   '因质量问题退车': 100, '机动车登记被依法撤销': 100, '被依法收缴并强制报废的': 100, '客运出租汽车经营资格证核发': 100,
                   '网络预约出租汽车驾驶员证核发': 100, '驾驶员客运资格证核发': 100, '认定教师资格': 100, '养犬登记': 100}
slot_max = list(slot_max_weight.keys())

# slot_set和action_set是在用到dqn的时候会用到，在agent.py用到
"""
slot_set={
'首次申请护照':0,'首次':1,
'护照加注':2,'曾用名':3,'曾用名加注':4,'繁体':5,'汉字':6,'英文':7,'多音字':8,'非标准':9,'汉语':10,'发音':11,'姓名':12,'姓名加注':13,'曾持照':14,'加注项':15,'加注':16,'曾持照加注':17,
'护照补发':18,'损毁':19,'不能使用':20,'被盗':21,'遗失':22,'补发':23,
'换发护照':24,'有效期':25,'届满':26,'签证页':27,'完毕':28,'换发':29,'普通':30,'护照':31,'外国':32,'定居':33,'探亲':34,'学习':35,'就业':36,'旅行':37,'商务活动':38,'非公务原因':39,'出国':40,'办理':41,'公民':42,
'初次申领机动车号牌和行驶证':43,'初次':44,'申领': 45, '号牌': 46, '行驶证': 47,
'改变车身颜色':48,'颜色': 49,
'更换发动机':50,'发动机': 51,
'更换车身车架':52,'车身': 53, '车架': 54,
'因质量问题更换整车':55,'更换': 56,'整车': 57,
'改变运营模式和使用性质':58,'改变': 59,'营运': 60, '非营运': 61, '模式': 62,'性质': 63,
'车辆管理所管辖区域改变':64,'变更': 65,'住所': 66,'迁入': 67, '迁出': 68, '管辖': 69, '区域': 70,
'已注册登记车辆所有权发生改变':71,'注册': 72, '道路': 73, '交通': 74, '违法': 75,'事故': 76, '所有权': 77, '转移': 78,
'机动车抵押':79,'消灭': 80, '解除': 81, '抵押物': 82, '抵押': 83,'抵押权': 84,
'已达到国家强制报废标准':85,'回收企业': 86, '交售': 87, '解体': 88, '回收证明': 89,
'灭失':90,
'因故不在我国境内使用':91,'不在': 92,'境内': 93, '使用': 94,
'因质量问题退车':95,'质量': 96,'问题': 97, '退车': 98,
'机动车登记被依法撤销':99,'撤销': 100,
'被依法收缴并强制报废的':101,'临时': 102, '通行牌证': 103, '签发': 104, '车辆管理所': 105, '所有人': 106, '登记地': 107, '申请': 108, '注销': 109, '达到': 110, '国家': 111, '强制': 112, '报废': 113, '标准': 114, '依法': 115, '收缴': 116,
'客运出租汽车经营资格证核发':117,'经营': 118,
'网络预约出租汽车驾驶员证核发':119,'网络': 120, '预约': 121, '出租': 122, '汽车': 123, '驾驶员证': 124,'准驾车型': 125,'3年以上': 126,'5年内': 127,
'驾驶员客运资格证核发':128,'客运': 129, '驾驶员': 130, '资格证': 131, '核发': 132, '三年以上': 133, '驾驶经历': 134, '机动车': 135, '驾驶证': 136, '职业': 137, '培训': 138,'申请日': 139, '五年内': 140, '吊销': 141, '连续3个记分周期': 142, '记满12分': 143,
'认定教师资格':144,'认定': 145, '天津': 146, '户籍': 147, '签注期限内': 148, '居住证': 149, '就读': 150, '学校': 151, '教师': 152, '资格': 153, '考试': 154, '合格': 155,
'养犬登记':156,'养犬': 157, '登记': 158, '本市': 159, '常住': 160, '户口': 161, '暂住': 162, '证件': 163, '合法': 164, '身份': 165, '证明': 166, '完全': 167,'民事': 168, '行为': 169, '能力': 170, '独户': 171, '居住': 172, '条件': 173,
'service':174
}

action_set={'request': 0, 'inform': 1, 'closing': 2,'deny': 3}
"""
